## Plan Result (ithc_frontdoor)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 84 to add, 0 to change, 84 to destroy.</code></pre>

* Create
  * module.premium_front_door.azapi_update_resource.frontdoor_system_identity
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain[&#34;c100-application&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain[&#34;pip-frontend&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain[&#34;sds-api-mgmt&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain[&#34;toffee&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain[&#34;vh-admin-web&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain[&#34;vh-service-web&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain[&#34;vh-test-web&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain[&#34;vh-video-web&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_A[&#34;c100-application&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_A[&#34;pip-frontend&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_A[&#34;sds-api-mgmt&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_A[&#34;toffee&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_A[&#34;vh-admin-web&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_A[&#34;vh-service-web&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_A[&#34;vh-test-web&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_A[&#34;vh-video-web&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_B[&#34;c100-application&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_B[&#34;pip-frontend&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_B[&#34;sds-api-mgmt&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_B[&#34;toffee&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_B[&#34;vh-admin-web&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_B[&#34;vh-service-web&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_B[&#34;vh-test-web&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_B[&#34;vh-video-web&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_endpoint.endpoint
  * module.premium_front_door.azurerm_cdn_frontdoor_firewall_policy.custom[&#34;c100-application&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_firewall_policy.custom[&#34;pip-frontend&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_firewall_policy.custom[&#34;sds-api-mgmt&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_firewall_policy.custom[&#34;toffee&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_firewall_policy.custom[&#34;vh-admin-web&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_firewall_policy.custom[&#34;vh-service-web&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_firewall_policy.custom[&#34;vh-test-web&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_firewall_policy.custom[&#34;vh-video-web&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_origin.defaultBackend_origin
  * module.premium_front_door.azurerm_cdn_frontdoor_origin.front_door_origin[&#34;c100-application&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_origin.front_door_origin[&#34;pip-frontend&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_origin.front_door_origin[&#34;sds-api-mgmt&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_origin.front_door_origin[&#34;toffee&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_origin.front_door_origin[&#34;vh-admin-web&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_origin.front_door_origin[&#34;vh-service-web&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_origin.front_door_origin[&#34;vh-test-web&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_origin.front_door_origin[&#34;vh-video-web&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_origin_group.defaultBackend
  * module.premium_front_door.azurerm_cdn_frontdoor_origin_group.origin_group[&#34;c100-application&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_origin_group.origin_group[&#34;pip-frontend&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_origin_group.origin_group[&#34;sds-api-mgmt&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_origin_group.origin_group[&#34;toffee&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_origin_group.origin_group[&#34;vh-admin-web&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_origin_group.origin_group[&#34;vh-service-web&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_origin_group.origin_group[&#34;vh-test-web&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_origin_group.origin_group[&#34;vh-video-web&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_profile.front_door
  * module.premium_front_door.azurerm_cdn_frontdoor_route.default_routing_rule
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;c100-application&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;pip-frontend&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;sds-api-mgmt&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;toffee&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;vh-admin-web&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;vh-service-web&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;vh-test-web&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;vh-video-web&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_B[&#34;c100-application&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_B[&#34;pip-frontend&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_B[&#34;sds-api-mgmt&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_B[&#34;toffee&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_B[&#34;vh-admin-web&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_B[&#34;vh-service-web&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_B[&#34;vh-test-web&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_B[&#34;vh-video-web&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule.https_redirect_rules
  * module.premium_front_door.azurerm_cdn_frontdoor_rule_set.https_redirect
  * module.premium_front_door.azurerm_cdn_frontdoor_security_policy.security_policy[&#34;c100-application&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_security_policy.security_policy[&#34;pip-frontend&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_security_policy.security_policy[&#34;sds-api-mgmt&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_security_policy.security_policy[&#34;toffee&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_security_policy.security_policy[&#34;vh-admin-web&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_security_policy.security_policy[&#34;vh-service-web&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_security_policy.security_policy[&#34;vh-test-web&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_security_policy.security_policy[&#34;vh-video-web&#34;]
  * module.premium_front_door.azurerm_key_vault_access_policy.frontdoor_premium_kv_access[0]
  * module.premium_front_door.azurerm_monitor_diagnostic_setting.diagnostics_access_logs_sa[0]
  * module.premium_front_door.azurerm_monitor_diagnostic_setting.frontdoor_diagnostics
  * module.premium_front_door.azurerm_role_assignment.frontdoor_premium_kv_access[0]
* Delete
  * module.premium_front_door[0].azapi_update_resource.frontdoor_system_identity
  * module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain.custom_domain[&#34;c100-application&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain.custom_domain[&#34;pip-frontend&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain.custom_domain[&#34;sds-api-mgmt&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain.custom_domain[&#34;toffee&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain.custom_domain[&#34;vh-admin-web&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain.custom_domain[&#34;vh-service-web&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain.custom_domain[&#34;vh-test-web&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain.custom_domain[&#34;vh-video-web&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain_association.custom_association_A[&#34;c100-application&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain_association.custom_association_A[&#34;pip-frontend&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain_association.custom_association_A[&#34;sds-api-mgmt&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain_association.custom_association_A[&#34;toffee&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain_association.custom_association_A[&#34;vh-admin-web&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain_association.custom_association_A[&#34;vh-service-web&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain_association.custom_association_A[&#34;vh-test-web&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain_association.custom_association_A[&#34;vh-video-web&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain_association.custom_association_B[&#34;c100-application&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain_association.custom_association_B[&#34;pip-frontend&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain_association.custom_association_B[&#34;sds-api-mgmt&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain_association.custom_association_B[&#34;toffee&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain_association.custom_association_B[&#34;vh-admin-web&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain_association.custom_association_B[&#34;vh-service-web&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain_association.custom_association_B[&#34;vh-test-web&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain_association.custom_association_B[&#34;vh-video-web&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_endpoint.endpoint
  * module.premium_front_door[0].azurerm_cdn_frontdoor_firewall_policy.custom[&#34;c100-application&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_firewall_policy.custom[&#34;pip-frontend&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_firewall_policy.custom[&#34;sds-api-mgmt&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_firewall_policy.custom[&#34;toffee&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_firewall_policy.custom[&#34;vh-admin-web&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_firewall_policy.custom[&#34;vh-service-web&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_firewall_policy.custom[&#34;vh-test-web&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_firewall_policy.custom[&#34;vh-video-web&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_origin.defaultBackend_origin
  * module.premium_front_door[0].azurerm_cdn_frontdoor_origin.front_door_origin[&#34;c100-application&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_origin.front_door_origin[&#34;pip-frontend&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_origin.front_door_origin[&#34;sds-api-mgmt&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_origin.front_door_origin[&#34;toffee&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_origin.front_door_origin[&#34;vh-admin-web&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_origin.front_door_origin[&#34;vh-service-web&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_origin.front_door_origin[&#34;vh-test-web&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_origin.front_door_origin[&#34;vh-video-web&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_origin_group.defaultBackend
  * module.premium_front_door[0].azurerm_cdn_frontdoor_origin_group.origin_group[&#34;c100-application&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_origin_group.origin_group[&#34;pip-frontend&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_origin_group.origin_group[&#34;sds-api-mgmt&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_origin_group.origin_group[&#34;toffee&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_origin_group.origin_group[&#34;vh-admin-web&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_origin_group.origin_group[&#34;vh-service-web&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_origin_group.origin_group[&#34;vh-test-web&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_origin_group.origin_group[&#34;vh-video-web&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_profile.front_door
  * module.premium_front_door[0].azurerm_cdn_frontdoor_route.default_routing_rule
  * module.premium_front_door[0].azurerm_cdn_frontdoor_route.routing_rule_A[&#34;c100-application&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_route.routing_rule_A[&#34;pip-frontend&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_route.routing_rule_A[&#34;sds-api-mgmt&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_route.routing_rule_A[&#34;toffee&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_route.routing_rule_A[&#34;vh-admin-web&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_route.routing_rule_A[&#34;vh-service-web&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_route.routing_rule_A[&#34;vh-test-web&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_route.routing_rule_A[&#34;vh-video-web&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_route.routing_rule_B[&#34;c100-application&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_route.routing_rule_B[&#34;pip-frontend&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_route.routing_rule_B[&#34;sds-api-mgmt&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_route.routing_rule_B[&#34;toffee&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_route.routing_rule_B[&#34;vh-admin-web&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_route.routing_rule_B[&#34;vh-service-web&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_route.routing_rule_B[&#34;vh-test-web&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_route.routing_rule_B[&#34;vh-video-web&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_rule.https_redirect_rules
  * module.premium_front_door[0].azurerm_cdn_frontdoor_rule_set.https_redirect
  * module.premium_front_door[0].azurerm_cdn_frontdoor_security_policy.security_policy[&#34;c100-application&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_security_policy.security_policy[&#34;pip-frontend&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_security_policy.security_policy[&#34;sds-api-mgmt&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_security_policy.security_policy[&#34;toffee&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_security_policy.security_policy[&#34;vh-admin-web&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_security_policy.security_policy[&#34;vh-service-web&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_security_policy.security_policy[&#34;vh-test-web&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_security_policy.security_policy[&#34;vh-video-web&#34;]
  * module.premium_front_door[0].azurerm_key_vault_access_policy.frontdoor_premium_kv_access[0]
  * module.premium_front_door[0].azurerm_monitor_diagnostic_setting.diagnostics_access_logs_sa[0]
  * module.premium_front_door[0].azurerm_monitor_diagnostic_setting.frontdoor_diagnostics
  * module.premium_front_door[0].azurerm_role_assignment.frontdoor_premium_kv_access[0]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.premium_front_door.azapi_update_resource.frontdoor_system_identity will be created
  + resource "azapi_update_resource" "frontdoor_system_identity" {
      + body                    = jsonencode(
            {
              + identity = {
                  + type = "SystemAssigned"
                }
            }
        )
      + id                      = (known after apply)
      + ignore_casing           = false
      + ignore_missing_property = true
      + name                    = (known after apply)
      + output                  = (known after apply)
      + parent_id               = (known after apply)
      + resource_id             = (known after apply)
      + response_export_values  = [
          + "identity.principalId",
          + "identity.tenantId",
        ]
      + type                    = "Microsoft.Cdn/profiles@2023-02-01-preview"
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain["c100-application"] will be created
  + resource "azurerm_cdn_frontdoor_custom_domain" "custom_domain" {
      + cdn_frontdoor_profile_id = (known after apply)
      + expiration_date          = (known after apply)
      + host_name                = "c100-application.ithc.platform.hmcts.net"
      + id                       = (known after apply)
      + name                     = "c100-application"
      + validation_token         = (known after apply)

      + tls {
          + cdn_frontdoor_secret_id = (known after apply)
          + certificate_type        = "ManagedCertificate"
          + minimum_tls_version     = "TLS12"
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain["pip-frontend"] will be created
  + resource "azurerm_cdn_frontdoor_custom_domain" "custom_domain" {
      + cdn_frontdoor_profile_id = (known after apply)
      + expiration_date          = (known after apply)
      + host_name                = "pip-frontend.ithc.platform.hmcts.net"
      + id                       = (known after apply)
      + name                     = "pip-frontend"
      + validation_token         = (known after apply)

      + tls {
          + cdn_frontdoor_secret_id = (known after apply)
          + certificate_type        = "ManagedCertificate"
          + minimum_tls_version     = "TLS12"
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain["sds-api-mgmt"] will be created
  + resource "azurerm_cdn_frontdoor_custom_domain" "custom_domain" {
      + cdn_frontdoor_profile_id = (known after apply)
      + expiration_date          = (known after apply)
      + host_name                = "sds-api-mgmt.ithc.platform.hmcts.net"
      + id                       = (known after apply)
      + name                     = "sds-api-mgmt"
      + validation_token         = (known after apply)

      + tls {
          + cdn_frontdoor_secret_id = (known after apply)
          + certificate_type        = "ManagedCertificate"
          + minimum_tls_version     = "TLS12"
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain["toffee"] will be created
  + resource "azurerm_cdn_frontdoor_custom_domain" "custom_domain" {
      + cdn_frontdoor_profile_id = (known after apply)
      + expiration_date          = (known after apply)
      + host_name                = "toffee.ithc.platform.hmcts.net"
      + id                       = (known after apply)
      + name                     = "toffee"
      + validation_token         = (known after apply)

      + tls {
          + cdn_frontdoor_secret_id = (known after apply)
          + certificate_type        = "ManagedCertificate"
          + minimum_tls_version     = "TLS12"
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain["vh-admin-web"] will be created
  + resource "azurerm_cdn_frontdoor_custom_domain" "custom_domain" {
      + cdn_frontdoor_profile_id = (known after apply)
      + expiration_date          = (known after apply)
      + host_name                = "vh-admin-web.ithc.platform.hmcts.net"
      + id                       = (known after apply)
      + name                     = "vh-admin-web"
      + validation_token         = (known after apply)

      + tls {
          + cdn_frontdoor_secret_id = (known after apply)
          + certificate_type        = "ManagedCertificate"
          + minimum_tls_version     = "TLS12"
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain["vh-service-web"] will be created
  + resource "azurerm_cdn_frontdoor_custom_domain" "custom_domain" {
      + cdn_frontdoor_profile_id = (known after apply)
      + expiration_date          = (known after apply)
      + host_name                = "vh-service-web.ithc.platform.hmcts.net"
      + id                       = (known after apply)
      + name                     = "vh-service-web"
      + validation_token         = (known after apply)

      + tls {
          + cdn_frontdoor_secret_id = (known after apply)
          + certificate_type        = "ManagedCertificate"
          + minimum_tls_version     = "TLS12"
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain["vh-test-web"] will be created
  + resource "azurerm_cdn_frontdoor_custom_domain" "custom_domain" {
      + cdn_frontdoor_profile_id = (known after apply)
      + expiration_date          = (known after apply)
      + host_name                = "vh-test-web.ithc.platform.hmcts.net"
      + id                       = (known after apply)
      + name                     = "vh-test-web"
      + validation_token         = (known after apply)

      + tls {
          + cdn_frontdoor_secret_id = (known after apply)
          + certificate_type        = "ManagedCertificate"
          + minimum_tls_version     = "TLS12"
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain["vh-video-web"] will be created
  + resource "azurerm_cdn_frontdoor_custom_domain" "custom_domain" {
      + cdn_frontdoor_profile_id = (known after apply)
      + expiration_date          = (known after apply)
      + host_name                = "vh-video-web.ithc.platform.hmcts.net"
      + id                       = (known after apply)
      + name                     = "vh-video-web"
      + validation_token         = (known after apply)

      + tls {
          + cdn_frontdoor_secret_id = (known after apply)
          + certificate_type        = "ManagedCertificate"
          + minimum_tls_version     = "TLS12"
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_A["c100-application"] will be created
  + resource "azurerm_cdn_frontdoor_custom_domain_association" "custom_association_A" {
      + cdn_frontdoor_custom_domain_id = (known after apply)
      + cdn_frontdoor_route_ids        = (known after apply)
      + id                             = (known after apply)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_A["pip-frontend"] will be created
  + resource "azurerm_cdn_frontdoor_custom_domain_association" "custom_association_A" {
      + cdn_frontdoor_custom_domain_id = (known after apply)
      + cdn_frontdoor_route_ids        = (known after apply)
      + id                             = (known after apply)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_A["sds-api-mgmt"] will be created
  + resource "azurerm_cdn_frontdoor_custom_domain_association" "custom_association_A" {
      + cdn_frontdoor_custom_domain_id = (known after apply)
      + cdn_frontdoor_route_ids        = (known after apply)
      + id                             = (known after apply)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_A["toffee"] will be created
  + resource "azurerm_cdn_frontdoor_custom_domain_association" "custom_association_A" {
      + cdn_frontdoor_custom_domain_id = (known after apply)
      + cdn_frontdoor_route_ids        = (known after apply)
      + id                             = (known after apply)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_A["vh-admin-web"] will be created
  + resource "azurerm_cdn_frontdoor_custom_domain_association" "custom_association_A" {
      + cdn_frontdoor_custom_domain_id = (known after apply)
      + cdn_frontdoor_route_ids        = (known after apply)
      + id                             = (known after apply)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_A["vh-service-web"] will be created
  + resource "azurerm_cdn_frontdoor_custom_domain_association" "custom_association_A" {
      + cdn_frontdoor_custom_domain_id = (known after apply)
      + cdn_frontdoor_route_ids        = (known after apply)
      + id                             = (known after apply)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_A["vh-test-web"] will be created
  + resource "azurerm_cdn_frontdoor_custom_domain_association" "custom_association_A" {
      + cdn_frontdoor_custom_domain_id = (known after apply)
      + cdn_frontdoor_route_ids        = (known after apply)
      + id                             = (known after apply)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_A["vh-video-web"] will be created
  + resource "azurerm_cdn_frontdoor_custom_domain_association" "custom_association_A" {
      + cdn_frontdoor_custom_domain_id = (known after apply)
      + cdn_frontdoor_route_ids        = (known after apply)
      + id                             = (known after apply)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_B["c100-application"] will be created
  + resource "azurerm_cdn_frontdoor_custom_domain_association" "custom_association_B" {
      + cdn_frontdoor_custom_domain_id = (known after apply)
      + cdn_frontdoor_route_ids        = (known after apply)
      + id                             = (known after apply)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_B["pip-frontend"] will be created
  + resource "azurerm_cdn_frontdoor_custom_domain_association" "custom_association_B" {
      + cdn_frontdoor_custom_domain_id = (known after apply)
      + cdn_frontdoor_route_ids        = (known after apply)
      + id                             = (known after apply)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_B["sds-api-mgmt"] will be created
  + resource "azurerm_cdn_frontdoor_custom_domain_association" "custom_association_B" {
      + cdn_frontdoor_custom_domain_id = (known after apply)
      + cdn_frontdoor_route_ids        = (known after apply)
      + id                             = (known after apply)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_B["toffee"] will be created
  + resource "azurerm_cdn_frontdoor_custom_domain_association" "custom_association_B" {
      + cdn_frontdoor_custom_domain_id = (known after apply)
      + cdn_frontdoor_route_ids        = (known after apply)
      + id                             = (known after apply)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_B["vh-admin-web"] will be created
  + resource "azurerm_cdn_frontdoor_custom_domain_association" "custom_association_B" {
      + cdn_frontdoor_custom_domain_id = (known after apply)
      + cdn_frontdoor_route_ids        = (known after apply)
      + id                             = (known after apply)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_B["vh-service-web"] will be created
  + resource "azurerm_cdn_frontdoor_custom_domain_association" "custom_association_B" {
      + cdn_frontdoor_custom_domain_id = (known after apply)
      + cdn_frontdoor_route_ids        = (known after apply)
      + id                             = (known after apply)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_B["vh-test-web"] will be created
  + resource "azurerm_cdn_frontdoor_custom_domain_association" "custom_association_B" {
      + cdn_frontdoor_custom_domain_id = (known after apply)
      + cdn_frontdoor_route_ids        = (known after apply)
      + id                             = (known after apply)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_B["vh-video-web"] will be created
  + resource "azurerm_cdn_frontdoor_custom_domain_association" "custom_association_B" {
      + cdn_frontdoor_custom_domain_id = (known after apply)
      + cdn_frontdoor_route_ids        = (known after apply)
      + id                             = (known after apply)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_endpoint.endpoint will be created
  + resource "azurerm_cdn_frontdoor_endpoint" "endpoint" {
      + cdn_frontdoor_profile_id = (known after apply)
      + enabled                  = true
      + host_name                = (known after apply)
      + id                       = (known after apply)
      + name                     = "sdshmcts-ithc"
      + tags                     = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/sds-azure-platform"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Medium"
          + "environment"  = "ithc"
          + "startupMode"  = "always"
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_firewall_policy.custom["c100-application"] will be created
  + resource "azurerm_cdn_frontdoor_firewall_policy" "custom" {
      + enabled               = true
      + frontend_endpoint_ids = (known after apply)
      + id                    = (known after apply)
      + mode                  = "Detection"
      + name                  = "c100applicationithcPremium"
      + resource_group_name   = "lz-ithc-rg"
      + sku_name              = "Premium_AzureFrontDoor"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/sds-azure-platform"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Medium"
          + "environment"  = "ithc"
          + "startupMode"  = "always"
        }

      + managed_rule {
          + action  = "Block"
          + type    = "DefaultRuleSet"
          + version = "1.0"

          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "_c100_application_session"
            }
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_firewall_policy.custom["pip-frontend"] will be created
  + resource "azurerm_cdn_frontdoor_firewall_policy" "custom" {
      + enabled               = true
      + frontend_endpoint_ids = (known after apply)
      + id                    = (known after apply)
      + mode                  = "Prevention"
      + name                  = "pipfrontendithcPremium"
      + resource_group_name   = "lz-ithc-rg"
      + sku_name              = "Premium_AzureFrontDoor"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/sds-azure-platform"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Medium"
          + "environment"  = "ithc"
          + "startupMode"  = "always"
        }

      + managed_rule {
          + action  = "Block"
          + type    = "DefaultRuleSet"
          + version = "1.0"
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_firewall_policy.custom["sds-api-mgmt"] will be created
  + resource "azurerm_cdn_frontdoor_firewall_policy" "custom" {
      + enabled               = true
      + frontend_endpoint_ids = (known after apply)
      + id                    = (known after apply)
      + mode                  = "Prevention"
      + name                  = "sdsapimgmtithcPremium"
      + resource_group_name   = "lz-ithc-rg"
      + sku_name              = "Premium_AzureFrontDoor"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/sds-azure-platform"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Medium"
          + "environment"  = "ithc"
          + "startupMode"  = "always"
        }

      + managed_rule {
          + action  = "Block"
          + type    = "DefaultRuleSet"
          + version = "1.0"
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_firewall_policy.custom["toffee"] will be created
  + resource "azurerm_cdn_frontdoor_firewall_policy" "custom" {
      + enabled               = true
      + frontend_endpoint_ids = (known after apply)
      + id                    = (known after apply)
      + mode                  = "Prevention"
      + name                  = "toffeeithcPremium"
      + resource_group_name   = "lz-ithc-rg"
      + sku_name              = "Premium_AzureFrontDoor"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/sds-azure-platform"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Medium"
          + "environment"  = "ithc"
          + "startupMode"  = "always"
        }

      + managed_rule {
          + action  = "Block"
          + type    = "DefaultRuleSet"
          + version = "1.0"
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_firewall_policy.custom["vh-admin-web"] will be created
  + resource "azurerm_cdn_frontdoor_firewall_policy" "custom" {
      + enabled               = true
      + frontend_endpoint_ids = (known after apply)
      + id                    = (known after apply)
      + mode                  = "Prevention"
      + name                  = "vhadminwebithcPremium"
      + resource_group_name   = "lz-ithc-rg"
      + sku_name              = "Premium_AzureFrontDoor"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/sds-azure-platform"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Medium"
          + "environment"  = "ithc"
          + "startupMode"  = "always"
        }

      + managed_rule {
          + action  = "Block"
          + type    = "DefaultRuleSet"
          + version = "1.0"

          + exclusion {
              + match_variable = "QueryStringArgNames"
              + operator       = "Equals"
              + selector       = "code"
            }
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_firewall_policy.custom["vh-service-web"] will be created
  + resource "azurerm_cdn_frontdoor_firewall_policy" "custom" {
      + enabled               = true
      + frontend_endpoint_ids = (known after apply)
      + id                    = (known after apply)
      + mode                  = "Prevention"
      + name                  = "vhservicewebithcPremium"
      + resource_group_name   = "lz-ithc-rg"
      + sku_name              = "Premium_AzureFrontDoor"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/sds-azure-platform"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Medium"
          + "environment"  = "ithc"
          + "startupMode"  = "always"
        }

      + managed_rule {
          + action  = "Block"
          + type    = "DefaultRuleSet"
          + version = "1.0"
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_firewall

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

c-rg/providers/Microsoft.Cdn/profiles/sdshmcts-ithc/ruleSets/httpsredirect" -> null
      - cdn_frontdoor_rule_set_name = "httpsredirect" -> null
      - id                          = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/lz-ithc-rg/providers/Microsoft.Cdn/profiles/sdshmcts-ithc/ruleSets/httpsredirect/rules/httpsredirectrule" -> null
      - name                        = "httpsredirectrule" -> null
      - order                       = 1 -> null

      - actions {
          - url_redirect_action {
              - redirect_protocol = "Https" -> null
              - redirect_type     = "Moved" -> null
            }
        }
    }

  # module.premium_front_door[0].azurerm_cdn_frontdoor_rule_set.https_redirect will be destroyed
  # (because module.premium_front_door[0] is not in configuration)
  - resource "azurerm_cdn_frontdoor_rule_set" "https_redirect" {
      - cdn_frontdoor_profile_id = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/lz-ithc-rg/providers/Microsoft.Cdn/profiles/sdshmcts-ithc" -> null
      - id                       = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/lz-ithc-rg/providers/Microsoft.Cdn/profiles/sdshmcts-ithc/ruleSets/httpsredirect" -> null
      - name                     = "httpsredirect" -> null
    }

  # module.premium_front_door[0].azurerm_cdn_frontdoor_security_policy.security_policy["c100-application"] will be destroyed
  # (because module.premium_front_door[0] is not in configuration)
  - resource "azurerm_cdn_frontdoor_security_policy" "security_policy" {
      - cdn_frontdoor_profile_id = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/lz-ithc-rg/providers/Microsoft.Cdn/profiles/sdshmcts-ithc" -> null
      - id                       = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/lz-ithc-rg/providers/Microsoft.Cdn/profiles/sdshmcts-ithc/securityPolicies/c100applicationithcPremium-securityPolicy" -> null
      - name                     = "c100applicationithcPremium-securityPolicy" -> null

      - security_policies {
          - firewall {
              - cdn_frontdoor_firewall_policy_id = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/lz-ithc-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/c100applicationithcPremium" -> null

              - association {
                  - patterns_to_match = [
                      - "/*",
                    ] -> null

                  - domain {
                      - active                  = true -> null
                      - cdn_frontdoor_domain_id = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/lz-ithc-rg/providers/Microsoft.Cdn/profiles/sdshmcts-ithc/customDomains/c100-application" -> null
                    }
                }
            }
        }
    }

  # module.premium_front_door[0].azurerm_cdn_frontdoor_security_policy.security_policy["pip-frontend"] will be destroyed
  # (because module.premium_front_door[0] is not in configuration)
  - resource "azurerm_cdn_frontdoor_security_policy" "security_policy" {
      - cdn_frontdoor_profile_id = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/lz-ithc-rg/providers/Microsoft.Cdn/profiles/sdshmcts-ithc" -> null
      - id                       = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/lz-ithc-rg/providers/Microsoft.Cdn/profiles/sdshmcts-ithc/securityPolicies/pipfrontendithcPremium-securityPolicy" -> null
      - name                     = "pipfrontendithcPremium-securityPolicy" -> null

      - security_policies {
          - firewall {
              - cdn_frontdoor_firewall_policy_id = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/lz-ithc-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/pipfrontendithcPremium" -> null

              - association {
                  - patterns_to_match = [
                      - "/*",
                    ] -> null

                  - domain {
                      - active                  = true -> null
                      - cdn_frontdoor_domain_id = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/lz-ithc-rg/providers/Microsoft.Cdn/profiles/sdshmcts-ithc/customDomains/pip-frontend" -> null
                    }
                }
            }
        }
    }

  # module.premium_front_door[0].azurerm_cdn_frontdoor_security_policy.security_policy["sds-api-mgmt"] will be destroyed
  # (because module.premium_front_door[0] is not in configuration)
  - resource "azurerm_cdn_frontdoor_security_policy" "security_policy" {
      - cdn_frontdoor_profile_id = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/lz-ithc-rg/providers/Microsoft.Cdn/profiles/sdshmcts-ithc" -> null
      - id                       = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/lz-ithc-rg/providers/Microsoft.Cdn/profiles/sdshmcts-ithc/securityPolicies/sdsapimgmtithcPremium-securityPolicy" -> null
      - name                     = "sdsapimgmtithcPremium-securityPolicy" -> null

      - security_policies {
          - firewall {
              - cdn_frontdoor_firewall_policy_id = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/lz-ithc-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/sdsapimgmtithcPremium" -> null

              - association {
                  - patterns_to_match = [
                      - "/*",
                    ] -> null

                  - domain {
                      - active                  = true -> null
                      - cdn_frontdoor_domain_id = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/lz-ithc-rg/providers/Microsoft.Cdn/profiles/sdshmcts-ithc/customDomains/sds-api-mgmt" -> null
                    }
                }
            }
        }
    }

  # module.premium_front_door[0].azurerm_cdn_frontdoor_security_policy.security_policy["toffee"] will be destroyed
  # (because module.premium_front_door[0] is not in configuration)
  - resource "azurerm_cdn_frontdoor_security_policy" "security_policy" {
      - cdn_frontdoor_profile_id = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/lz-ithc-rg/providers/Microsoft.Cdn/profiles/sdshmcts-ithc" -> null
      - id                       = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/lz-ithc-rg/providers/Microsoft.Cdn/profiles/sdshmcts-ithc/securityPolicies/toffeeithcPremium-securityPolicy" -> null
      - name                     = "toffeeithcPremium-securityPolicy" -> null

      - security_policies {
          - firewall {
              - cdn_frontdoor_firewall_policy_id = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/lz-ithc-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/toffeeithcPremium" -> null

              - association {
                  - patterns_to_match = [
                      - "/*",
                    ] -> null

                  - domain {
                      - active                  = true -> null
                      - cdn_frontdoor_domain_id = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/lz-ithc-rg/providers/Microsoft.Cdn/profiles/sdshmcts-ithc/customDomains/toffee" -> null
                    }
                }
            }
        }
    }

  # module.premium_front_door[0].azurerm_cdn_frontdoor_security_policy.security_policy["vh-admin-web"] will be destroyed
  # (because module.premium_front_door[0] is not in configuration)
  - resource "azurerm_cdn_frontdoor_security_policy" "security_policy" {
      - cdn_frontdoor_profile_id = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/lz-ithc-rg/providers/Microsoft.Cdn/profiles/sdshmcts-ithc" -> null
      - id                       = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/lz-ithc-rg/providers/Microsoft.Cdn/profiles/sdshmcts-ithc/securityPolicies/vhadminwebithcPremium-securityPolicy" -> null
      - name                     = "vhadminwebithcPremium-securityPolicy" -> null

      - security_policies {
          - firewall {
              - cdn_frontdoor_firewall_policy_id = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/lz-ithc-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/vhadminwebithcPremium" -> null

              - association {
                  - patterns_to_match = [
                      - "/*",
                    ] -> null

                  - domain {
                      - active                  = true -> null
                      - cdn_frontdoor_domain_id = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/lz-ithc-rg/providers/Microsoft.Cdn/profiles/sdshmcts-ithc/customDomains/vh-admin-web" -> null
                    }
                }
            }
        }
    }

  # module.premium_front_door[0].azurerm_cdn_frontdoor_security_policy.security_policy["vh-service-web"] will be destroyed
  # (because module.premium_front_door[0] is not in configuration)
  - resource "azurerm_cdn_frontdoor_security_policy" "security_policy" {
      - cdn_frontdoor_profile_id = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/lz-ithc-rg/providers/Microsoft.Cdn/profiles/sdshmcts-ithc" -> null
      - id                       = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/lz-ithc-rg/providers/Microsoft.Cdn/profiles/sdshmcts-ithc/securityPolicies/vhservicewebithcPremium-securityPolicy" -> null
      - name                     = "vhservicewebithcPremium-securityPolicy" -> null

      - security_policies {
          - firewall {
              - cdn_frontdoor_firewall_policy_id = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/lz-ithc-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/vhservicewebithcPremium" -> null

              - association {
                  - patterns_to_match = [
                      - "/*",
                    ] -> null

                  - domain {
                      - active                  = true -> null
                      - cdn_frontdoor_domain_id = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/lz-ithc-rg/providers/Microsoft.Cdn/profiles/sdshmcts-ithc/customDomains/vh-service-web" -> null
                    }
                }
            }
        }
    }

  # module.premium_front_door[0].azurerm_cdn_frontdoor_security_policy.security_policy["vh-test-web"] will be destroyed
  # (because module.premium_front_door[0] is not in configuration)
  - resource "azurerm_cdn_frontdoor_security_policy" "security_policy" {
      - cdn_frontdoor_profile_id = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/lz-ithc-rg/providers/Microsoft.Cdn/profiles/sdshmcts-ithc" -> null
      - id                       = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/lz-ithc-rg/providers/Microsoft.Cdn/profiles/sdshmcts-ithc/securityPolicies/vhtestwebithcPremium-securityPolicy" -> null
      - name                     = "vhtestwebithcPremium-securityPolicy" -> null

      - security_policies {
          - firewall {
              - cdn_frontdoor_firewall_policy_id = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/lz-ithc-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/vhtestwebithcPremium" -> null

              - association {
                  - patterns_to_match = [
                      - "/*",
                    ] -> null

                  - domain {
                      - active                  = true -> null
                      - cdn_frontdoor_domain_id = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/lz-ithc-rg/providers/Microsoft.Cdn/profiles/sdshmcts-ithc/customDomains/vh-test-web" -> null
                    }
                }
            }
        }
    }

  # module.premium_front_door[0].azurerm_cdn_frontdoor_security_policy.security_policy["vh-video-web"] will be destroyed
  # (because module.premium_front_door[0] is not in configuration)
  - resource "azurerm_cdn_frontdoor_security_policy" "security_policy" {
      - cdn_frontdoor_profile_id = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/lz-ithc-rg/providers/Microsoft.Cdn/profiles/sdshmcts-ithc" -> null
      - id                       = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/lz-ithc-rg/providers/Microsoft.Cdn/profiles/sdshmcts-ithc/securityPolicies/vhvideowebithcPremium-securityPolicy" -> null
      - name                     = "vhvideowebithcPremium-securityPolicy" -> null

      - security_policies {
          - firewall {
              - cdn_frontdoor_firewall_policy_id = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/lz-ithc-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/vhvideowebithcPremium" -> null

              - association {
                  - patterns_to_match = [
                      - "/*",
                    ] -> null

                  - domain {
                      - active                  = true -> null
                      - cdn_frontdoor_domain_id = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/lz-ithc-rg/providers/Microsoft.Cdn/profiles/sdshmcts-ithc/customDomains/vh-video-web" -> null
                    }
                }
            }
        }
    }

  # module.premium_front_door[0].azurerm_key_vault_access_policy.frontdoor_premium_kv_access[0] will be destroyed
  # (because module.premium_front_door[0] is not in configuration)
  - resource "azurerm_key_vault_access_policy" "frontdoor_premium_kv_access" {
      - certificate_permissions = [
          - "Get",
          - "List",
        ] -> null
      - id                      = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/sds-platform-ithc-rg/providers/Microsoft.KeyVault/vaults/acmedtssdsithc/objectId/a86663bc-6390-4e5f-84c1-b38862724a66" -> null
      - key_permissions         = [
          - "Get",
          - "List",
        ] -> null
      - key_vault_id            = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/sds-platform-ithc-rg/providers/Microsoft.KeyVault/vaults/acmedtssdsithc" -> null
      - object_id               = "a86663bc-6390-4e5f-84c1-b38862724a66" -> null
      - secret_permissions      = [
          - "Get",
          - "List",
        ] -> null
      - storage_permissions     = [] -> null
      - tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null
    }

  # module.premium_front_door[0].azurerm_monitor_diagnostic_setting.diagnostics_access_logs_sa[0] will be destroyed
  # (because module.premium_front_door[0] is not in configuration)
  - resource "azurerm_monitor_diagnostic_setting" "diagnostics_access_logs_sa" {
      - id                 = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/lz-ithc-rg/providers/Microsoft.Cdn/profiles/sdshmcts-ithc|fd-log-analytics-logs-sa" -> null
      - name               = "fd-log-analytics-logs-sa" -> null
      - storage_account_id = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/lz-ithc-rg/providers/Microsoft.Storage/storageAccounts/hmctssdsdiagithc" -> null
      - target_resource_id = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/lz-ithc-rg/providers/Microsoft.Cdn/profiles/sdshmcts-ithc" -> null

      - enabled_log {
          - category = "FrontdoorAccessLog" -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

      - log {
          - category = "FrontDoorHealthProbeLog" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - log {
          - category = "FrontDoorWebApplicationFirewallLog" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - log {
          - category = "FrontdoorAccessLog" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
    }

  # module.premium_front_door[0].azurerm_monitor_diagnostic_setting.frontdoor_diagnostics will be destroyed
  # (because module.premium_front_door[0] is not in configuration)
  - resource "azurerm_monitor_diagnostic_setting" "frontdoor_diagnostics" {
      - id                         = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/lz-ithc-rg/providers/Microsoft.Cdn/profiles/sdshmcts-ithc|fd-log-analytics" -> null
      - log_analytics_workspace_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/oms-automation/providers/Microsoft.OperationalInsights/workspaces/hmcts-nonprod" -> null
      - name                       = "fd-log-analytics" -> null
      - target_resource_id         = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/lz-ithc-rg/providers/Microsoft.Cdn/profiles/sdshmcts-ithc" -> null

      - enabled_log {
          - category = "FrontdoorWebApplicationFirewallLog" -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

      - log {
          - category = "FrontDoorAccessLog" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - log {
          - category = "FrontDoorHealthProbeLog" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - log {
          - category = "FrontdoorWebApplicationFirewallLog" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
    }

  # module.premium_front_door[0].azurerm_role_assignment.frontdoor_premium_kv_access[0] will be destroyed
  # (because module.premium_front_door[0] is not in configuration)
  - resource "azurerm_role_assignment" "frontdoor_premium_kv_access" {
      - id                   = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/sds-platform-ithc-rg/providers/Microsoft.KeyVault/vaults/acmedtssdsithc/providers/Microsoft.Authorization/roleAssignments/47d46867-30ae-0d6b-ef7c-2ace38f1a2cd" -> null
      - name                 = "47d46867-30ae-0d6b-ef7c-2ace38f1a2cd" -> null
      - principal_id         = "a86663bc-6390-4e5f-84c1-b38862724a66" -> null
      - principal_type       = "ServicePrincipal" -> null
      - role_definition_id   = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/providers/Microsoft.Authorization/roleDefinitions/4633458b-17de-408a-b874-0445c86b69e6" -> null
      - role_definition_name = "Key Vault Secrets User" -> null
      - scope                = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/sds-platform-ithc-rg/providers/Microsoft.KeyVault/vaults/acmedtssdsithc" -> null
    }

Plan: 84 to add, 0 to change, 84 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":611,"Program":"tfcmt","SHA1":"","Target":"ithc_frontdoor","Vars":{}} -->